## Pandas kütüphanesinin özellikleri
# Series
# Dataframe
# Multi İndex
# Group by
# Özel fonksiyonlar
# Birden fazla data frame ile çalışma
# Excel dosyası üzerinden çalışma

In [1]:
import numpy as np
import pandas as pd

## Series / Seriler

In [2]:
benimSozlugum = {"Atil":50,"Zeynep":40,"Mehmet":30}

In [3]:
pd.Series(benimSozlugum)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [4]:
benimYaslarim = [50,40,30]
benimIsimlerim = ["Atil","Zeynep","Mehmet"]

In [5]:
pd.Series(benimYaslarim)

0    50
1    40
2    30
dtype: int64

In [6]:
pd.Series(benimYaslarim,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [7]:
pd.Series(data=benimYaslarim,index=benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [8]:
numpyDizisi = np.array([50,40,30])

In [9]:
pd.Series(numpyDizisi,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [10]:
pd.Series(["Atil","Atlas","Osman"],[1,2,3])

1     Atil
2    Atlas
3    Osman
dtype: object

In [11]:
yarismaSonucu1 = pd.Series([10,5,1],["Atil","Atlas","Osman"])

In [12]:
yarismaSonucu1

Atil     10
Atlas     5
Osman     1
dtype: int64

In [13]:
yarismaSonucu2 = pd.Series([20,10,8],["Atil","Atlas","Osman"])

In [14]:
yarismaSonucu2

Atil     20
Atlas    10
Osman     8
dtype: int64

In [15]:
yarismaSonucu2["Atlas"]

10

In [16]:
sonSonuc = yarismaSonucu1+yarismaSonucu2

In [17]:
sonSonuc

Atil     30
Atlas    15
Osman     9
dtype: int64

In [18]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [19]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [20]:
farkliSeries

a    20
b    30
c    40
d    50
dtype: int64

In [21]:
farkliSeries2

a    10
c     5
f     3
g     1
dtype: int64

In [22]:
#farklı indexler var ise ortak kesişenleri alıyor
sonuc = farkliSeries + farkliSeries2

In [23]:
sonuc

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## Data frame

In [24]:
data = np.random.randn(4,3)

In [25]:
data

array([[ 2.10330187,  0.87618034,  2.51392784],
       [-0.21970761,  1.65188189,  0.75628132],
       [-0.69324442,  0.3144802 , -0.66125583],
       [ 0.33482836, -0.66859134, -0.9753359 ]])

In [26]:
dataFrame = pd.DataFrame(data)

In [27]:
dataFrame

          0         1         2
0  2.103302  0.876180  2.513928
1 -0.219708  1.651882  0.756281
2 -0.693244  0.314480 -0.661256
3  0.334828 -0.668591 -0.975336

In [28]:
dataFrame[0]

0    2.103302
1   -0.219708
2   -0.693244
3    0.334828
Name: 0, dtype: float64

In [29]:
type(dataFrame[0])

pandas.core.series.Series

In [30]:
yeniDataFrame = pd.DataFrame(data,index = ["Levent","Burak","Emre","Emirman"], columns = ["Maas","Yas","Calisma saati"])

In [31]:
yeniDataFrame

             Maas       Yas  Calisma saati
Levent   2.103302  0.876180       2.513928
Burak   -0.219708  1.651882       0.756281
Emre    -0.693244  0.314480      -0.661256
Emirman  0.334828 -0.668591      -0.975336

In [32]:
yeniDataFrame["Yas"]

Levent     0.876180
Burak      1.651882
Emre       0.314480
Emirman   -0.668591
Name: Yas, dtype: float64

In [33]:
yeniDataFrame[["Maas","Yas"]]

             Maas       Yas
Levent   2.103302  0.876180
Burak   -0.219708  1.651882
Emre    -0.693244  0.314480
Emirman  0.334828 -0.668591

In [34]:
yeniDataFrame.loc["Levent"]

Maas             2.103302
Yas              0.876180
Calisma saati    2.513928
Name: Levent, dtype: float64

In [35]:
yeniDataFrame.iloc[1]

Maas            -0.219708
Yas              1.651882
Calisma saati    0.756281
Name: Burak, dtype: float64

In [36]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"]*2

In [37]:
yeniDataFrame

             Maas       Yas  Calisma saati  Emeklilik Yasi
Levent   2.103302  0.876180       2.513928        1.752361
Burak   -0.219708  1.651882       0.756281        3.303764
Emre    -0.693244  0.314480      -0.661256        0.628960
Emirman  0.334828 -0.668591      -0.975336       -1.337183

In [38]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

             Maas       Yas  Calisma saati
Levent   2.103302  0.876180       2.513928
Burak   -0.219708  1.651882       0.756281
Emre    -0.693244  0.314480      -0.661256
Emirman  0.334828 -0.668591      -0.975336

In [39]:
yeniDataFrame.drop("Burak",axis=0)

             Maas       Yas  Calisma saati  Emeklilik Yasi
Levent   2.103302  0.876180       2.513928        1.752361
Emre    -0.693244  0.314480      -0.661256        0.628960
Emirman  0.334828 -0.668591      -0.975336       -1.337183

In [40]:
yeniDataFrame

             Maas       Yas  Calisma saati  Emeklilik Yasi
Levent   2.103302  0.876180       2.513928        1.752361
Burak   -0.219708  1.651882       0.756281        3.303764
Emre    -0.693244  0.314480      -0.661256        0.628960
Emirman  0.334828 -0.668591      -0.975336       -1.337183

In [41]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)

In [42]:
yeniDataFrame

             Maas       Yas  Calisma saati
Levent   2.103302  0.876180       2.513928
Burak   -0.219708  1.651882       0.756281
Emre    -0.693244  0.314480      -0.661256
Emirman  0.334828 -0.668591      -0.975336

In [43]:
yeniDataFrame.loc["Levent"]

Maas             2.103302
Yas              0.876180
Calisma saati    2.513928
Name: Levent, dtype: float64

In [44]:
#yeniData.Frame.loc["Levent","Calisma saati"]
yeniDataFrame.loc["Levent"]["Calisma saati"]

2.513927842611588

In [45]:
booleanFrame = yeniDataFrame < 0

In [46]:
booleanFrame

          Maas    Yas  Calisma saati
Levent   False  False          False
Burak     True  False          False
Emre      True  False           True
Emirman  False   True           True

In [47]:
yeniDataFrame[booleanFrame]

             Maas       Yas  Calisma saati
Levent        NaN       NaN            NaN
Burak   -0.219708       NaN            NaN
Emre    -0.693244       NaN      -0.661256
Emirman       NaN -0.668591      -0.975336

In [48]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma saati
Levent  2.103302  0.876180       2.513928
Burak  -0.219708  1.651882       0.756281
Emre   -0.693244  0.314480      -0.661256

In [49]:
yeniDataFrame[(yeniDataFrame["Yas"] < 0) & (yeniDataFrame["Maas"] > -1)]

             Maas       Yas  Calisma saati
Emirman  0.334828 -0.668591      -0.975336

In [50]:
yeniDataFrame

             Maas       Yas  Calisma saati
Levent   2.103302  0.876180       2.513928
Burak   -0.219708  1.651882       0.756281
Emre    -0.693244  0.314480      -0.661256
Emirman  0.334828 -0.668591      -0.975336

In [51]:
yeniDataFrame.reset_index()

     index      Maas       Yas  Calisma saati
0   Levent  2.103302  0.876180       2.513928
1    Burak -0.219708  1.651882       0.756281
2     Emre -0.693244  0.314480      -0.661256
3  Emirman  0.334828 -0.668591      -0.975336

In [52]:
yeniIndexListesi = ["Lev","Bur","Emr","Emi"]

In [53]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [54]:
yeniDataFrame

             Maas       Yas  Calisma saati Yeni Index
Levent   2.103302  0.876180       2.513928        Lev
Burak   -0.219708  1.651882       0.756281        Bur
Emre    -0.693244  0.314480      -0.661256        Emr
Emirman  0.334828 -0.668591      -0.975336        Emi

In [55]:
yeniDataFrame.set_index("Yeni Index",inplace = True)

In [56]:
yeniDataFrame

                Maas       Yas  Calisma saati
Yeni Index
Lev         2.103302  0.876180       2.513928
Bur        -0.219708  1.651882       0.756281
Emr        -0.693244  0.314480      -0.661256
Emi         0.334828 -0.668591      -0.975336

## Multi Index

In [57]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [58]:
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
birlesmisIndex = list(zip(ilkIndexler,icIndexler))

In [60]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)

In [62]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[40,"E"],[40,"F"]]

In [63]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [64]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndex,columns = ["Yas","Meslek"])

In [65]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    40      E
           Kyle     40      F

In [66]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [67]:
cizgiFilmDataFrame.loc["Simpson"].loc["Marge"]

Yas       30
Meslek     C
Name: Marge, dtype: object

In [68]:
cizgiFilmDataFrame.index.names = ["Film adı","İsim"]

In [69]:
cizgiFilmDataFrame

                   Yas Meslek
Film adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    40      E
           Kyle     40      F

## Operasyonlar

In [70]:
sozlukVerisi = {"Istanbul" :[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [71]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [72]:
gunlerListesi = ["Pazartesi","Salı","Çarşamba"]

In [73]:
havaDurumuDataFrame["Gunler"] = gunlerListesi

In [74]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir     Gunler
0      30.0    20.0     40  Pazartesi
1      29.0     NaN     39       Salı
2       NaN    25.0     38   Çarşamba

In [75]:
havaDurumuDataFrame.set_index("Gunler",inplace = True)

In [76]:
havaDurumuDataFrame

           Istanbul  Ankara  Izmir
Gunler
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Çarşamba        NaN    25.0     38

In [77]:
havaDurumuDataFrame.dropna()

           Istanbul  Ankara  Izmir
Gunler
Pazartesi      30.0    20.0     40

In [78]:
# axis = 1 column  axis = 0 row
havaDurumuDataFrame.dropna(axis = 1)

           Izmir
Gunler
Pazartesi     40
Salı          39
Çarşamba      38

In [79]:
yeniVeri = {"Istanbul" :[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [80]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [81]:
#none 2 olanları siliyor
yeniDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [82]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [83]:
maasSozlugu = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Çalışan Ismi":["Ahmet","Mehmet","Levent","Burak","Emre","Fatma"],
               "Maas":[100,150,200,300,400,500]
              }

In [84]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [85]:
maasDataFrame

   Departman Çalışan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama       Levent   200
3  Pazarlama        Burak   300
4      Hukuk         Emre   400
5      Hukuk        Fatma   500

In [86]:
grupObjesi = maasDataFrame.groupby("Departman")

In [87]:
grupObjesi.count()

           Çalışan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [88]:
grupObjesi["Maas"].mean()

Departman
Hukuk        450.0
Pazarlama    250.0
Yazılım      125.0
Name: Maas, dtype: float64

In [89]:
grupObjesi.max()

          Çalışan Ismi  Maas
Departman
Hukuk            Fatma   500
Pazarlama       Levent   300
Yazılım         Mehmet   150

In [90]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Birden fazla dataframe ile çalışma

In [91]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori": [100,200,300,400]
          }

sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori": [200,100,50,300]
          }

sozluk3 = {"Isim" : ["Ayşe","Mahmut","Duygu","Nur"],
           "Spor": ["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori": [300,400,500,250]
          }

In [92]:
dataFrame1 = pd.DataFrame(sozluk1, index =[0,1,2,3])
dataFrame2 = pd.DataFrame(sozluk2, index =[4,5,6,7])
dataFrame3 = pd.DataFrame(sozluk3, index =[8,9,10,10])

In [93]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [94]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [95]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
10     Nur      Tenis     250

## concatenation

In [96]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
10     Nur      Tenis     250

## merge

In [97]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Kalori": [100,200,300,400]
          }

mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"]
          }

In [98]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [99]:
mergeDataFrame1

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3    Atıl     400

In [100]:
mergeDataFrame2

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [101]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim  Kalori       Spor
0   Ahmet     100       Koşu
1  Mehmet     200      Yüzme
2  Zeynep     300       Koşu
3    Atıl     400  Basketbol

In [102]:
maasSozluk = {"Çalışan Ismi":["Ahmet","Mehmet","Levent","Burak","Emre","Fatma"],
              "Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Maas":[100,150,200,300,400,500]
              }

In [103]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [104]:
maasDataFrame

  Çalışan Ismi  Departman  Maas
0        Ahmet    Yazılım   100
1       Mehmet    Yazılım   150
2       Levent  Pazarlama   200
3        Burak  Pazarlama   300
4         Emre      Hukuk   400
5        Fatma      Hukuk   500

In [105]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Pazarlama', 'Hukuk'], dtype=object)

In [106]:
maasDataFrame["Departman"].nunique()

3

In [107]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Pazarlama    2
Hukuk        2
Name: count, dtype: int64

In [108]:
def bruttenNete(maas):
    return maas * 0.66

maasDataFrame["Maas"].apply(bruttenNete)

0     66.0
1     99.0
2    132.0
3    198.0
4    264.0
5    330.0
Name: Maas, dtype: float64

In [109]:
maasDataFrame.isnull()

   Çalışan Ismi  Departman   Maas
0         False      False  False
1         False      False  False
2         False      False  False
3         False      False  False
4         False      False  False
5         False      False  False

In [110]:
yeniBirVeri = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson"],
               "Karakter Ismi": ["Cartman", "Kenny","Homer", "Bart"],
               "Karakter Yas": [9,10,50,20]
              }

In [111]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [112]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [113]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   20.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0

In [114]:
yeniBirVeri2 = {"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
               "Karakter Ismi": ["Cartman", "Kenny","Homer", "Bart","Bart"],
               "Karakter Yas": [9,10,50,20,10]
              }

In [115]:
karakterDF2 = pd.DataFrame(yeniBirVeri2)

In [116]:
karakterDF2

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [117]:
#İkinci bartı almıyor böyle
karakterDF.pivot_table(values = "Karakter Yas", 
                       index = ["Karakter Sınıfı",
                                "Karakter Ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                   20.0
                Homer                  50.0
South Park      Cartman                 9.0
                Kenny                  10.0

In [118]:
karakterDF2.pivot_table(
    values="Karakter Yas", 
    index=["Karakter Sınıfı", "Karakter Ismi"], 
    aggfunc="sum"
)

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

## Excel dosyası ile çalışma

In [119]:
dataFrame = pd.read_excel("veri.xlsx")

In [120]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200  10.0        NaN
3      Ahmet    50  30.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [121]:
doluDegerlerDataFrame = dataFrame.dropna()
doluDegerlerDataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atıl   100  40.0    Yazılım
1     Zeynep   150  50.0      Satış
3      Ahmet    50  30.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [122]:
doluDegerlerDataFrame.to_excel("yeni_veri.xlsx")

## Levent Aslan BTK akademi pandas kütüphanesi ile çalışmasındaki örnek kodlar